{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a8cfc749-8764-4ff2-a104-7929b211e659",
   "metadata": {},
   "source": [
    "Год рождения\n",
    "\n",
    "Имеется словарь, в котором хранятся имена и возраст работников некой компании. Необходимо узнать год рождения работника. Напишите программу которая сможет определить дату рождения работника, имя которого ввели. Принять, что у каждого работника уже был день рождения в этом году.\n",
    "\n",
    "Формат ввода:\n",
    "число n - количество работников в компании\n",
    "словарь в формате имя:возраст\n",
    "имя работника, дату рождения которого надо узнать\n",
    "\n",
    "Формат вывода:\n",
    "Год рождения этого работника"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "805f8fb7-dea6-44d9-8cc6-9a4c97433e78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "введите число работников:  2\n",
      "введите имя сотрудника:  андрей\n",
      "введите возраст сотрудника:  36\n",
      "введите имя сотрудника:  вадим\n",
      "введите возраст сотрудника:  28\n",
      "введите имя работника, год рождения которого хотите узнать:  вадим\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1997\n"
     ]
    }
   ],
   "source": [
    "dict1 = {}\n",
    "n = int(input('введите число работников: '))\n",
    "for i in range(n):\n",
    "    a = input('введите имя сотрудника: ')\n",
    "    b = int(input('введите возраст сотрудника: '))\n",
    "    dict1[a] = b\n",
    "c = input('введите имя работника, год рождения которого хотите узнать: ')\n",
    "d = int(dict1[c])\n",
    "e = 2025 - d\n",
    "print(e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ed29c6b5-b33c-4871-bd68-182c3a007bcb",
   "metadata": {},
   "source": [
    "Творческая работа\n",
    "\n",
    "Пете в школе задали сделать доклад на свободную тему. Он уже придумал несколько, но чтобы не было так, что он случайно выбрал тему, которая уже\n",
    "у кого-то есть, он решил свериться с одноклассниками. Если какая-то из тем повторяется, то Петя уберёт её из списка идей.\n",
    "\n",
    "Формат ввода:\n",
    "число n количества тем, выбранных Петей\n",
    "выписать темы, которые выбрал Петя\n",
    "число m количества тем, выбранных его одноклассником\n",
    "выписать темы, которые выбрал Петин одноклассник\n",
    "\n",
    "Формат вывода:\n",
    "темы, которые нужно убрать"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "947145c1-fb9e-4a9b-bb9f-065c526bab90",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "число n количества тем, выбранных Петей:  2\n",
      "темы, которые выбрал Петя:  Геология\n",
      "темы, которые выбрал Петя:  Астрономия\n",
      "число m количества тем, выбранных его одноклассником:  2\n",
      "выписать темы, которые выбрал Петин одноклассник:  Геология\n",
      "выписать темы, которые выбрал Петин одноклассник:  Метеорология\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Геология\n"
     ]
    }
   ],
   "source": [
    "n = int(input('число n количества тем, выбранных Петей: '))\n",
    "set1 = set({})\n",
    "set2 = set({})\n",
    "for i in range(n):\n",
    "    set1.add(input('темы, которые выбрал Петя: '))\n",
    "m = int(input('число m количества тем, выбранных его одноклассником: '))\n",
    "for j in range(m):\n",
    "    set2.add(input('выписать темы, которые выбрал Петин одноклассник: '))\n",
    "a = set1 & set2\n",
    "print(*a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f8c3baf9-37a5-40fd-b370-7af55f2f4c89",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
